-- MySQL dump 10.13  Distrib 8.0.15, for Win64 (x86_64)
--
-- Host: localhost    Database: new
-- ------------------------------------------------------
-- Server version	8.0.15

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `paymentdetail`
--

DROP TABLE IF EXISTS `paymentdetail`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `paymentdetail` (
  `payment_detail_id` int(11) NOT NULL AUTO_INCREMENT,
  `registration_paper_id` int(11) DEFAULT NULL,
  `invoice_number` bigint(11) DEFAULT NULL,
  `program_id` int(11) DEFAULT NULL,
  `medicine_nonmedicine_registration` int(11) DEFAULT NULL,
  `program_name` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `unit_price` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `number` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `x_department_id` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `funded_time` datetime DEFAULT NULL,
  `funded_operator_id` int(11) DEFAULT NULL,
  `way_to_pay_id` int(11) DEFAULT NULL,
  `complete_detail_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`payment_detail_id`) USING BTREE,
  KEY `registration_paper_id_payment_detail` (`registration_paper_id`) USING BTREE,
  CONSTRAINT `registration_paper_id_payment_detail` FOREIGN KEY (`registration_paper_id`) REFERENCES `registrationpaper` (`registration_paper_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=415 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `paymentdetail`
--

LOCK TABLES `paymentdetail` WRITE;
/*!40000 ALTER TABLE `paymentdetail` DISABLE KEYS */;
INSERT INTO `paymentdetail` VALUES (358,223,800870,0,3,'挂号费','51','1','9','2019-07-18 08:26:33',8,51,0),(359,223,800870,0,3,'挂号费','-51','1','9','2019-07-18 08:28:42',8,51,NULL),(360,224,800872,0,3,'挂号费','51','1','9','2019-07-18 08:30:37',8,51,0),(361,224,800873,1,1,'注射用甲氨喋呤','16','2','9','2019-07-18 08:33:17',8,51,92),(362,224,800873,3,1,'50%葡萄糖注射液(塑瓶)','25','1','9','2019-07-18 08:33:17',8,51,93),(363,224,800873,6,1,'盐酸氨酮戊酸散（外用）','20','2','9','2019-07-18 08:33:17',8,51,94),(364,224,800873,4,1,'盐酸特比萘芬泡腾片（丁克）','41','3','9','2019-07-18 08:33:17',8,51,95),(365,225,800875,0,3,'挂号费','51','1','9','2019-07-26 10:25:37',8,51,0),(366,226,800876,0,3,'挂号费','51','1','9','2019-07-26 10:26:42',8,51,0),(367,227,800877,0,3,'挂号费','51','1','9','2019-07-26 10:41:22',8,51,0),(368,228,800878,0,3,'挂号费','51','1','9','2019-07-26 10:43:28',8,51,0),(369,229,800879,0,3,'挂号费','50','1','1','2019-07-26 12:01:26',9,51,0),(370,230,800880,0,3,'挂号费','50','1','1','2019-07-26 12:03:15',9,51,0),(371,231,800881,0,3,'挂号费','50','1','1','2019-07-26 12:03:59',9,51,0),(372,232,800882,0,3,'挂号费','50','1','1','2019-07-26 12:08:18',9,51,0),(373,233,800883,0,3,'挂号费','50','1','1','2019-07-26 12:10:57',9,51,0),(374,234,800884,0,3,'挂号费','51','1','1','2019-07-26 12:11:12',9,51,0),(375,235,800885,0,3,'挂号费','51','1','1','2019-07-26 12:11:17',9,51,0),(376,236,800886,0,3,'挂号费','51','1','1','2019-07-26 12:19:07',9,51,0),(377,237,800887,0,3,'挂号费','51','1','1','2019-07-26 12:19:29',9,51,0),(378,238,800888,0,3,'挂号费','51','1','1','2019-07-26 12:21:44',9,51,0),(379,239,800889,0,3,'挂号费','51','1','1','2019-07-26 12:26:52',9,51,0),(380,240,800890,0,3,'挂号费','50','1','1','2019-07-26 12:27:42',9,51,0),(381,241,800891,0,3,'挂号费','50','1','1','2019-07-26 12:28:49',9,51,0),(382,238,800888,0,3,'挂号费','-51','1','1','2019-07-26 15:44:25',9,51,NULL),(383,239,800889,0,3,'挂号费','-51','1','1','2019-07-26 15:51:33',9,51,NULL),(384,240,800890,0,3,'挂号费','-50','1','1','2019-07-26 15:53:33',9,51,NULL),(385,241,800891,0,3,'挂号费','-50','1','1','2019-07-26 15:55:10',9,51,NULL),(386,236,800886,0,3,'挂号费','-51','1','1','2019-07-26 15:56:19',9,51,NULL),(387,229,800879,0,3,'挂号费','-50','1','1','2019-07-26 15:58:26',9,51,NULL),(388,230,800880,0,3,'挂号费','-50','1','1','2019-07-26 15:58:32',9,51,NULL),(389,242,800899,0,3,'挂号费','51','1','1','2019-07-27 11:57:59',9,51,0),(390,243,800900,0,3,'挂号费','51','1','1','2019-07-27 12:00:56',9,51,0),(391,244,800901,0,3,'挂号费','51','1','1','2019-07-28 14:47:33',9,51,0),(392,245,800902,0,3,'挂号费','50','1','1','2019-07-29 11:14:34',9,51,0),(393,246,800904,0,3,'挂号费','50','1','1','2019-07-30 11:57:05',9,51,0),(394,247,800915,0,3,'挂号费','8','1','1','2019-08-30 10:16:25',9,51,0),(395,248,800916,0,3,'挂号费','8','1','1','2019-08-30 10:24:55',9,51,0),(396,249,800917,0,3,'挂号费','8','1','1','2019-08-30 10:33:44',9,51,0),(397,250,800918,0,3,'挂号费','50','1','1','2019-08-30 10:46:18',9,51,0),(398,251,800919,0,3,'挂号费','50','1','1','2019-08-30 10:48:00',9,51,0),(399,252,800935,0,3,'挂号费','51','1','1','2019-08-31 09:55:14',9,51,0),(400,248,800916,0,3,'挂号费','-8','1','1','2019-08-31 10:47:45',9,51,NULL),(401,249,800917,0,3,'挂号费','-8','1','1','2019-08-31 10:47:57',9,51,NULL),(402,253,800938,0,3,'挂号费','51','1','1','2019-08-31 10:49:50',9,51,0),(403,253,800938,0,3,'挂号费','-51','1','1','2019-08-31 10:51:29',9,51,NULL),(404,254,800940,0,3,'挂号费','50','1','1','2019-08-31 15:28:15',9,51,0),(405,254,800940,0,3,'挂号费','-50','1','1','2019-08-31 16:27:00',9,51,NULL),(406,255,800943,0,3,'挂号费','50','1','1','2019-08-31 19:22:43',9,51,0),(407,256,800944,0,3,'挂号费','50','1','1','2019-08-31 19:22:50',9,51,0),(408,257,800945,0,3,'挂号费','50','1','1','2019-09-01 10:13:32',9,51,0),(409,257,800945,0,3,'挂号费','-50','1','1','2019-09-01 10:13:52',9,51,NULL),(410,258,800947,0,3,'挂号费','50','1','1','2019-09-01 10:14:26',9,51,0),(411,259,800949,0,3,'挂号费','50','1','1','2019-09-01 10:29:17',9,51,0),(412,260,800950,0,3,'挂号费','50','1','1','2019-09-01 10:30:50',9,51,0),(413,261,800951,0,3,'挂号费','50','1','1','2019-09-01 10:31:41',9,51,0),(414,262,800952,0,3,'挂号费','50','1','1','2019-09-01 10:34:23',9,51,0);
/*!40000 ALTER TABLE `paymentdetail` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-09-01 10:37:48
